OpenDTEF-v2012/tutorials/combustion/fireFoam/LES/simplePMMApanel/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    outlet
    {
        type        fixedFluxPressure;
    }

    ground
    {
        type        fixedFluxPressure;
    }

    side
    {
        type            totalPressure;
        p0              $internalField;
    }

    frontAndBack
    {
        type            empty;
    }

    region0_to_panelRegion_panel
    {
        type            fixedFluxPressure;
    }
}


// ************************************************************************* //
